## lesson 4 pandas

In [1]:
import pandas as pd

In [34]:
s=pd.Series([1,3,5,6,8])#会自动赋值索引

** Series 带索引的一维数组 **

** numpy的一维数组 ndarray **

In [3]:
s

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [9]:
s=pd.Series([1,3,5,7,9],index=['a','b','c','d','e'])

In [10]:
s

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [11]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [12]:
s.values

array([1, 3, 5, 7, 9], dtype=int64)

In [13]:
s['a']

1

In [14]:
s[['a','b']]#多个索引要用列表

a    1
b    3
dtype: int64

In [15]:
s[s>4]

c    5
d    7
e    9
dtype: int64

In [16]:
s*5 #广播到每个

a     5
b    15
c    25
d    35
e    45
dtype: int64

In [17]:
import numpy as np 
np.mean(s)

5.0

In [18]:
s.mean()

5.0

In [21]:
'a' in s.index #判断是否在其中

True

In [22]:
1 in s.values

True

In [25]:
b=pd.Series({'a':1,'b':2,'c':3},index=['b','c','d'])#从字典中按索引取值，无对应值的用NaN

In [26]:
b

b    2.0
c    3.0
d    NaN
dtype: float64

In [27]:
pd.isnull(b)#判断是否空值

b    False
c    False
d     True
dtype: bool

In [28]:
pd.notnull(b)#判断非空

b     True
c     True
d    False
dtype: bool

In [29]:
b=pd.Series({'a':1,'b':2,'c':3})#会按照索引对齐进行计算

In [31]:
c=pd.Series({'b':3,'c':4,'d':5})

In [32]:
b+c#a,d在另一个中没有

a    NaN
b    5.0
c    7.0
d    NaN
dtype: float64

## lesson 5 DateFrame

In [45]:
data =pd.DataFrame({'a':[1,2,3,4],
                    'b':pd.Series([2,3,4,5],index=list(range(4)),dtype='float32'),
                    'c':np.array([3]*4,dtype='int32')})#指定了值，索引，数据类型,DataFrame

In [46]:
data

   a    b  c
0  1  2.0  3
1  2  3.0  3
2  3  4.0  3
3  4  5.0  3

In [48]:
#首先定义一个序号
xuhao=['one','two','three','four','five','six']
df=pd.DataFrame(np.random.randn(6,4),index=xuhao,columns=list('abcd'))#list将字符串转化成列表,.columns 列索引

In [49]:
df

              a         b         c         d
one   -2.561494 -0.055046 -0.323914 -0.064548
two    0.367949 -1.549337 -1.392984 -1.678187
three -0.404420  1.211323  0.646753 -1.453286
four  -0.488057 -2.371089  1.163088 -1.824852
five  -0.564747 -0.710875  0.180889 -0.781182
six   -0.970039 -0.685345 -0.025848 -2.469670

In [51]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [52]:
df.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [53]:
df['a']#选取一列

one     -2.561494
two      0.367949
three   -0.404420
four    -0.488057
five    -0.564747
six     -0.970039
Name: a, dtype: float64

In [54]:
df.a#选取一列

one     -2.561494
two      0.367949
three   -0.404420
four    -0.488057
five    -0.564747
six     -0.970039
Name: a, dtype: float64

In [55]:
df[['a','c']]#要以列表的形式传入

              a         c
one   -2.561494 -0.323914
two    0.367949 -1.392984
three -0.404420  0.646753
four  -0.488057  1.163088
five  -0.564747  0.180889
six   -0.970039 -0.025848

In [56]:
df[['a','b','c']]#取列

              a         b         c
one   -2.561494 -0.055046 -0.323914
two    0.367949 -1.549337 -1.392984
three -0.404420  1.211323  0.646753
four  -0.488057 -2.371089  1.163088
five  -0.564747 -0.710875  0.180889
six   -0.970039 -0.685345 -0.025848

In [64]:
df[0:3]#单取行

              a         b         c         d
one   -2.561494 -0.055046 -0.323914 -0.064548
two    0.367949 -1.549337 -1.392984 -1.678187
three -0.404420  1.211323  0.646753 -1.453286

In [59]:
df.loc['one']#用切片取第一行,指定行的索引

a   -2.561494
b   -0.055046
c   -0.323914
d   -0.064548
Name: one, dtype: float64

In [60]:
df.loc[['one','four']]

             a         b         c         d
one  -2.561494 -0.055046 -0.323914 -0.064548
four -0.488057 -2.371089  1.163088 -1.824852

In [62]:
df.loc[['one','two'],'c']#c列的第一行和第二行

one   -0.323914
two   -1.392984
Name: c, dtype: float64

In [61]:
#取多行多列
df.loc[['one','four'],['c','d']]

             c         d
one  -0.323914 -0.064548
four  1.163088 -1.824852

In [63]:
#取全部值 用 冒号 ：
df.loc[:,['c','d']]

              c         d
one   -0.323914 -0.064548
two   -1.392984 -1.678187
three  0.646753 -1.453286
four   1.163088 -1.824852
five   0.180889 -0.781182
six   -0.025848 -2.469670

In [65]:
#用位置来取值用 iloc
df.iloc[1:3,0:2]

              a         b
two    0.367949 -1.549337
three -0.404420  1.211323

In [66]:
df.iloc[1:2,:]

            a         b         c         d
two  0.367949 -1.549337 -1.392984 -1.678187

In [68]:
#布尔型索引
df[df>0]#显示了df中大于0的值

              a         b         c   d
one         NaN       NaN       NaN NaN
two    0.367949       NaN       NaN NaN
three       NaN  1.211323  0.646753 NaN
four        NaN       NaN  1.163088 NaN
five        NaN       NaN  0.180889 NaN
six         NaN       NaN       NaN NaN

** 显示a列小于0的数据 **

In [69]:
df[df.a<0]

              a         b         c         d
one   -2.561494 -0.055046 -0.323914 -0.064548
three -0.404420  1.211323  0.646753 -1.453286
four  -0.488057 -2.371089  1.163088 -1.824852
five  -0.564747 -0.710875  0.180889 -0.781182
six   -0.970039 -0.685345 -0.025848 -2.469670

In [70]:
df['f']=np.arange(6)

In [71]:
df

              a         b         c         d  f
one   -2.561494 -0.055046 -0.323914 -0.064548  0
two    0.367949 -1.549337 -1.392984 -1.678187  1
three -0.404420  1.211323  0.646753 -1.453286  2
four  -0.488057 -2.371089  1.163088 -1.824852  3
five  -0.564747 -0.710875  0.180889 -0.781182  4
six   -0.970039 -0.685345 -0.025848 -2.469670  5

In [73]:
df['g']=pd.Series([4,5,6,7],index=['one','two','four','eight'])

In [75]:
df#索引和数值对应，没有索引的取NaN

              a         b         c         d  f    g
one   -2.561494 -0.055046 -0.323914 -0.064548  0  4.0
two    0.367949 -1.549337 -1.392984 -1.678187  1  5.0
three -0.404420  1.211323  0.646753 -1.453286  2  NaN
four  -0.488057 -2.371089  1.163088 -1.824852  3  6.0
five  -0.564747 -0.710875  0.180889 -0.781182  4  NaN
six   -0.970039 -0.685345 -0.025848 -2.469670  5  NaN

** 用嵌套的字典生成DataFrame,外层的默认为列的索引，内层为行的索引。 **

In [77]:
zd={'one':{'a':12,'b':13},
    'two':{'a':14,'d':15}}
data=pd.DataFrame(zd)

In [78]:
data

    one   two
a  12.0  14.0
b  13.0   NaN
d   NaN  15.0